RESULTS/PERFCNTR/sqlite_nodatapersist_disablog_HWCNTR_all.out
Enter application name and arguments as params for the script
Keys:       16 bytes each
Values:     100 bytes each
Entries:    300000
RawSize:    33.2 MB (estimated)
------------------------------------------------
fillseq      :       6.162 micros/op;   18.0 MB/s
fillseqsync  :       5.867 micros/op;   18.9 MB/s (3000 ops)
fillseqbatch :       4.638 micros/op;   23.9 MB/s
fillrandom   :       8.221 micros/op;   13.5 MB/s
fillrandsync :       6.868 micros/op;   16.1 MB/s (3000 ops)
fillrandbatch :       6.932 micros/op;   16.0 MB/s
overwrite    :       9.832 micros/op;   11.3 MB/s
overwritebatch :       9.467 micros/op;   11.7 MB/s
readrandom   :       4.445 micros/op;
readseq      :       1.591 micros/op;   59.9 MB/s
fillrand100K :     112.646 micros/op;  846.7 MB/s (300 ops)
fillseq100K  :      89.877 micros/op; 1061.3 MB/s (300 ops)
readseq      :      14.547 micros/op; 6555.9 MB/s
readrand100K :      17.523 micros/op;
             :       0.000 micros/op;
-------------------------------------------------------------
-------------------------------------------------------------
CPU type:	Intel Core Haswell processor 
CPU clock:	3.39 GHz 
-------------------------------------------------------------
/home/sudarsun/libs/linux-examples/leveldb-1.14.0/db_bench_mem_sqlite3_nojournal
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+--------+--------+--------+
|                   Event                   |   core 0    |   core 1    |   core 2    |   core 3    | core 4 | core 5 | core 6 | core 7 |
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+--------+--------+--------+
|             INSTR_RETIRED_ANY             | 8.96485e+10 | 1.96526e+09 | 5.99295e+08 | 1.70548e+07 |   0    | 14176  |   0    |   0    |
| MEM_LOAD_UOPS_LLC_MISS_RETIRED_LOCAL_DRAM | 2.45629e+07 | 1.90018e+06 | 1.24063e+06 |    54803    |   0    |  366   |   0    |   0    |
|           MEM_UOP_RETIRED_LOADS           | 3.71176e+10 | 6.21169e+08 | 1.83511e+08 | 6.04931e+06 |   0    |  4100  |   0    |   0    |
|          MEM_UOP_RETIRED_STORES           | 1.60808e+10 | 2.29238e+08 | 1.50978e+08 | 1.41467e+06 |   0    |  2342  |   0    |   0    |
|             INSTR_RETIRED_ANY             | 8.96485e+10 | 1.96526e+09 | 5.99295e+08 | 1.70548e+07 |   0    | 14176  |   0    |   0    |
|           CPU_CLK_UNHALTED_CORE           | 5.9418e+10  | 9.04733e+08 | 9.96442e+08 | 1.33062e+07 |   0    | 127359 |   0    |   0    |
|           CPU_CLK_UNHALTED_REF            | 5.18085e+10 | 7.90592e+08 | 8.69949e+08 | 1.16443e+07 |   0    | 111044 |   0    |   0    |
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+--------+--------+--------+
+------------------------------------------------+-------------+-------------+-----+-------------+
|                     Event                      |     Sum     |     Max     | Min |     Avg     |
+------------------------------------------------+-------------+-------------+-----+-------------+
|             INSTR_RETIRED_ANY STAT             | 9.22301e+10 | 8.96485e+10 |  0  | 1.15288e+10 |
| MEM_LOAD_UOPS_LLC_MISS_RETIRED_LOCAL_DRAM STAT | 2.77589e+07 | 2.45629e+07 |  0  | 3.46986e+06 |
|           MEM_UOP_RETIRED_LOADS STAT           | 3.79283e+10 | 3.71176e+10 |  0  | 4.74104e+09 |
|          MEM_UOP_RETIRED_STORES STAT           | 1.64625e+10 | 1.60808e+10 |  0  | 2.05781e+09 |
|             INSTR_RETIRED_ANY STAT             | 9.22301e+10 | 8.96485e+10 |  0  | 1.15288e+10 |
|           CPU_CLK_UNHALTED_CORE STAT           | 6.13326e+10 | 5.9418e+10  |  0  | 7.66657e+09 |
|           CPU_CLK_UNHALTED_REF STAT            | 5.34807e+10 | 5.18085e+10 |  0  | 6.68509e+09 |
+------------------------------------------------+-------------+-------------+-----+-------------+
+----------------------+----------+----------+----------+------------+---------+-------------+---------+---------+
|        Metric        |  core 0  |  core 1  |  core 2  |   core 3   | core 4  |   core 5    | core 6  | core 7  |
+----------------------+----------+----------+----------+------------+---------+-------------+---------+---------+
| Runtime (RDTSC) [s]  | 15.5659  | 15.5659  | 15.5659  |  15.5659   | 15.5659 |   15.5659   | 15.5659 | 15.5659 |
| Runtime unhalted [s] | 17.5168  | 0.266722 | 0.293758 | 0.00392276 |    0    | 3.75463e-05 |    0    |    0    |
|     Clock [MHz]      | 3890.27  | 3881.77  | 3885.26  |  3876.17   |    0    |   3890.42   |    0    |    0    |
|         CPI          | 0.662788 | 0.460362 | 1.66269  |  0.780205  |    0    |   8.98413   |    0    |    0    |
+----------------------+----------+----------+----------+------------+---------+-------------+---------+---------+
Enter application name and arguments as params for the script
Keys:       16 bytes each
Values:     100 bytes each
Entries:    300000
RawSize:    33.2 MB (estimated)
------------------------------------------------
fillseq      :       6.177 micros/op;   17.9 MB/s
fillseqsync  :       5.894 micros/op;   18.8 MB/s (3000 ops)
fillseqbatch :       4.529 micros/op;   24.4 MB/s
fillrandom   :       8.168 micros/op;   13.5 MB/s
fillrandsync :       6.802 micros/op;   16.3 MB/s (3000 ops)
fillrandbatch :       6.896 micros/op;   16.0 MB/s
overwrite    :       9.763 micros/op;   11.3 MB/s
overwritebatch :       9.446 micros/op;   11.7 MB/s
readrandom   :       4.340 micros/op;
readseq      :       1.549 micros/op;   61.6 MB/s
fillrand100K :     112.250 micros/op;  849.7 MB/s (300 ops)
fillseq100K  :      89.823 micros/op; 1061.9 MB/s (300 ops)
readseq      :      17.877 micros/op; 5334.8 MB/s
readrand100K :      19.853 micros/op;
             :       0.000 micros/op;
-------------------------------------------------------------
-------------------------------------------------------------
CPU type:	Intel Core Haswell processor 
CPU clock:	3.39 GHz 
-------------------------------------------------------------
/home/sudarsun/libs/linux-examples/leveldb-1.14.0/db_bench_mem_sqlite3_nojournal
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+--------+--------+--------+
|                   Event                   |   core 0    |   core 1    |   core 2    |   core 3    | core 4 | core 5 | core 6 | core 7 |
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+--------+--------+--------+
|             INSTR_RETIRED_ANY             | 8.96485e+10 | 2.05225e+09 | 5.73873e+08 |   603926    |   0    | 14176  |   0    |   0    |
| MEM_LOAD_UOPS_LLC_MISS_RETIRED_LOCAL_DRAM | 2.4146e+07  | 2.08809e+06 | 1.2129e+06  |    6115     |   0    |  359   |   0    |   0    |
|           MEM_UOP_RETIRED_LOADS           | 3.71176e+10 | 6.52979e+08 | 1.74807e+08 |   143860    |   0    |  4100  |   0    |   0    |
|          MEM_UOP_RETIRED_STORES           | 1.60808e+10 | 2.36362e+08 | 1.47184e+08 |    80891    |   0    |  2342  |   0    |   0    |
|             INSTR_RETIRED_ANY             | 8.96485e+10 | 2.05225e+09 | 5.73873e+08 |   603926    |   0    | 14176  |   0    |   0    |
|           CPU_CLK_UNHALTED_CORE           | 5.88496e+10 | 9.50031e+08 | 9.71026e+08 | 3.74325e+06 |   0    | 124272 |   0    |   0    |
|           CPU_CLK_UNHALTED_REF            | 5.13742e+10 | 8.31829e+08 | 8.49955e+08 | 3.28154e+06 |   0    | 108358 |   0    |   0    |
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+--------+--------+--------+
+------------------------------------------------+-------------+-------------+-----+-------------+
|                     Event                      |     Sum     |     Max     | Min |     Avg     |
+------------------------------------------------+-------------+-------------+-----+-------------+
|             INSTR_RETIRED_ANY STAT             | 9.22752e+10 | 8.96485e+10 |  0  | 1.15344e+10 |
| MEM_LOAD_UOPS_LLC_MISS_RETIRED_LOCAL_DRAM STAT | 2.74534e+07 | 2.4146e+07  |  0  | 3.43168e+06 |
|           MEM_UOP_RETIRED_LOADS STAT           | 3.79455e+10 | 3.71176e+10 |  0  | 4.74319e+09 |
|          MEM_UOP_RETIRED_STORES STAT           | 1.64645e+10 | 1.60808e+10 |  0  | 2.05806e+09 |
|             INSTR_RETIRED_ANY STAT             | 9.22752e+10 | 8.96485e+10 |  0  | 1.15344e+10 |
|           CPU_CLK_UNHALTED_CORE STAT           | 6.07746e+10 | 5.88496e+10 |  0  | 7.59682e+09 |
|           CPU_CLK_UNHALTED_REF STAT            | 5.30594e+10 | 5.13742e+10 |  0  | 6.63242e+09 |
+------------------------------------------------+-------------+-------------+-----+-------------+
+----------------------+----------+----------+----------+------------+---------+-------------+---------+---------+
|        Metric        |  core 0  |  core 1  |  core 2  |   core 3   | core 4  |   core 5    | core 6  | core 7  |
+----------------------+----------+----------+----------+------------+---------+-------------+---------+---------+
| Runtime (RDTSC) [s]  | 15.3723  | 15.3723  | 15.3723  |  15.3723   | 15.3723 |   15.3723   | 15.3723 | 15.3723 |
| Runtime unhalted [s] | 17.3494  | 0.280078 | 0.286267 | 0.00110354 |    0    | 3.66365e-05 |    0    |    0    |
|     Clock [MHz]      |  3885.6  | 3874.03  |  3875.2  |  3869.28   |    0    |   3890.2    |    0    |    0    |
|         CPI          | 0.656449 | 0.462922 | 1.69206  |  6.19819   |    0    |   8.76637   |    0    |    0    |
+----------------------+----------+----------+----------+------------+---------+-------------+---------+---------+